Ran Plan for project: `demo` dir: `.infra/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_region.current: Reading...
data.aws_iam_policy_document.iam_policy_demo_rds: Reading...
data.aws_availability_zones.available: Reading...
data.aws_eks_cluster.demo: Reading...
data.aws_caller_identity.current: Reading...
data.aws_eks_cluster.feature_staging: Reading...
data.aws_iam_policy_document.iam_policy_demo_rds: Read complete after 0s [id=3092048313]
data.aws_region.current: Read complete after 0s [id=us-east-2]
data.aws_caller_identity.current: Read complete after 0s [id=347383665746]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
data.aws_eks_cluster.demo: Read complete after 0s [id=tm-demo]
data.aws_eks_cluster.feature_staging: Read complete after 0s [id=tm-feature-staging]
data.aws_iam_policy_document.oidc_assume_role_policy: Reading...
data.aws_iam_policy_document.oidc_assume_role_policy: Read complete after 0s [id=1645897926]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_role.IAM-role will be created
+ resource "aws_iam_role" "IAM-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-2.amazonaws.com/id/2DA892D54364F6EC484E8EF0CBBAE0CD:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-2.amazonaws.com/id/2DA892D54364F6EC484E8EF0CBBAE0CD:sub" = "system:serviceaccount:demo:medplum-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::347383665746:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/2DA892D54364F6EC484E8EF0CBBAE0CD"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-2.amazonaws.com/id/3B6A2E9C0C79CDC93DAE9D954027E5AC:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-2.amazonaws.com/id/3B6A2E9C0C79CDC93DAE9D954027E5AC:sub" = "system:serviceaccount:demo:medplum-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::347383665746:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/3B6A2E9C0C79CDC93DAE9D954027E5AC"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "K8-ServiceAccount-IAMRole-medplum"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Confidentiality" = "sensitive"
          + "Contact"         = "slack/eng-infra-support"
          + "Environment"     = "demo"
          + "ManagedBy"       = "terraform"
          + "Project"         = "medplum"
          + "Repo"            = "https://github.com/ThirtyMadison/medplum"
          + "Team"            = "infra-dx"
        }
      + unique_id             = (known after apply)
    }

  # vault_kubernetes_auth_backend_role.role will be created
+ resource "vault_kubernetes_auth_backend_role" "role" {
      + alias_name_source                = (known after apply)
      + backend                          = "kubernetes-service"
      + bound_service_account_names      = [
          + "medplum-sa",
        ]
      + bound_service_account_namespaces = [
          + "demo",
        ]
      + id                               = (known after apply)
      + role_name                        = "medplum-service"
      + token_policies                   = [
          + "vault_single_medplum_demo",
        ]
      + token_ttl                        = 86400
      + token_type                       = "default"
    }

  # vault_policy.policy will be created
+ resource "vault_policy" "policy" {
      + id     = (known after apply)
      + name   = "vault_single_medplum_demo"
      + policy = <<-EOT
            path "database/creds/medplum-core-service-read-only" {
              capabilities = [ "read" ]
            }
            path "kv/data/medplum" {
              capabilities = ["read", "list"]
            }
        EOT
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "vault_identifier" but a
│ value was found in file "env/demo.tfvars". If you meant to use this value,
│ add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.ffar0wwu.com/lock?id=ThirtyMadison%252Fmedplum%252F.infra%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p demo`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`